In [10]:
import mysql.connector
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
# Information of the AMAZON REDSHIFT database.
host = "database-alertas-sismicas.crcnepco0igw.us-east-1.rds.amazonaws.com"
user = "admin"
password = "admin4168"
database = "alertasSismicas"

In [12]:
# Opening the conection to the database
connection = mysql.connector.connect(
    host = host,
    user = user,
    password = password,
    database = database
)

In [13]:
# Executing a query to confirm if its working
cursor = connection.cursor()
cursor.execute("SHOW TABLES")
tables = cursor.fetchall()
tables

[('CHILE',),
 ('COUNTRIES',),
 ('FACTS',),
 ('FACTS2',),
 ('JAPAN',),
 ('SISMOTEST',),
 ('TSUNAMIS',),
 ('USA',)]

In [14]:
# SELECTING the table "SISMOTEST" and giving the info to a pandas dataframe
query = ("SELECT * FROM FACTS2;")
FACTS2 = pd.read_sql(query, connection)
FACTS2.head(2)

C:\Users\juanp\AppData\Local\Temp\ipykernel_13484\2150596333.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  FACTS2 = pd.read_sql(query, connection)

,FactId,idcountry,mag,place,time,tsunami,Ing,lat,depth,danger
0,1-16587,1,3.1,"16 km S of Smiley, Texas",2023-05-22 08:36:25,0,-97.650620,29.120178,5.062134,3
1,1-16588,1,3.1,"58 km S of Whites City, New Mexico",2023-05-22 14:20:30,0,-104.321792,31.654087,6.851392,3

In [15]:
FACTS2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   FactId     67 non-null     object
 1   idcountry  67 non-null     int64
 2   mag        67 non-null     float64
 3   place      67 non-null     object
 4   time       67 non-null     datetime64[ns]
 5   tsunami    67 non-null     object
 6   Ing        67 non-null     float64
 7   lat        67 non-null     float64
 8   depth      67 non-null     float64
 9   danger     67 non-null     int64
dtypes: datetime64[ns](1), float64(4), int64(2), object(3)
memory usage: 5.4+ KB

In [16]:
# SELECTING the table "FACTS" and giving the info to a pandas dataframe
query = ("SELECT * FROM FACTS;")
facts = pd.read_sql(query, connection)
facts.head(2)

C:\Users\juanp\AppData\Local\Temp\ipykernel_13484\2509127209.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  facts = pd.read_sql(query, connection)

,idsismo,idcountry,mag,place,time,tsunami,lng,lat,depth,danger
0,1,2,3.24,"11km N of Delta, B.C., MX",2009-12-31 21:33:42,0,-115.202833,32.453833,5.995,2
1,2,2,3.00,"10 km SW of Fairview, Wyoming",2009-12-31 23:13:44,0,-111.058000,42.616000,5.000,2

In [17]:
facts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40579 entries, 0 to 40578
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   idsismo    40579 non-null  int64
 1   idcountry  40579 non-null  int64
 2   mag        40579 non-null  float64
 3   place      40579 non-null  object
 4   time       40579 non-null  datetime64[ns]
 5   tsunami    40579 non-null  object
 6   lng        40579 non-null  float64
 7   lat        40579 non-null  float64
 8   depth      40579 non-null  float64
 9   danger     40579 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(3), object(2)
memory usage: 3.1+ MB

In [18]:
# SELECTING the table "JAPAN" and giving the info to a pandas dataframe
query = ("SELECT * FROM JAPAN;")
japan = pd.read_sql(query, connection)
japan.head(2)

C:\Users\juanp\AppData\Local\Temp\ipykernel_13484\3099851293.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  japan = pd.read_sql(query, connection)

,idsismo,idcountry,mag,place,time,tsunami,lng,lat,depth,danger
0,1,3,4.3,"35 km S of Shizunai-furukawach?, Japan",2010-01-06 15:39:40,0,142.291,42.017,70.2,2
1,2,3,4.4,"105 km NE of Hasaki, Japan",2010-01-06 20:36:07,0,141.775,36.294,37.5,2

In [19]:
# SELECTING the table "USA" and giving the info to a pandas dataframe
query = ("SELECT * FROM USA;")
usa = pd.read_sql(query, connection)
usa.head(2)

C:\Users\juanp\AppData\Local\Temp\ipykernel_13484\630404544.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  usa = pd.read_sql(query, connection)

,idsismo,idcountry,mag,place,time,tsunami,lng,lat,depth,danger
0,1,2,3.24,"11km N of Delta, B.C., MX",2009-12-31 21:33:42,0,-115.202833,32.453833,5.995,2
1,2,2,3.00,"10 km SW of Fairview, Wyoming",2009-12-31 23:13:44,0,-111.058000,42.616000,5.000,2

In [20]:
# Closing the conection with the database
connection.close()